<details ><summary>plan for portal 2024-12-17 02:40:25 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project LumeWeb/testing.pinner.xyz-devops#portal has been locked by PR #4
</details>

<details open="true"><summary>Plan output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd_autopilot will be created
  + resource "cloudns_dns_record" "renterd_autopilot" {
      + id    = (known after apply)
      + name  = "autopilot.node.testing.pinner.xyz"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_bus will be created
  + resource "cloudns_dns_record" "renterd_bus" {
      + id    = (known after apply)
      + name  = "bus.node.testing.pinner.xyz"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # cloudns_dns_record.renterd_workers[0] will be created
  + resource "cloudns_dns_record" "renterd_workers" {
      + id    = (known after apply)
      + name  = "worker.node.testing.pinner.xyz"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "pinner.xyz"
    }

  # module.proxysql.module.proxysql_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388219:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388214:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service will be updated in-place
  ~ resource "akash_deployment" "service" {
        id                            = "19388216:1:1:akash1pvy8zyzqwz2r2jl9j9d3zrfmg6dqc5hy6fh2dc:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn"
      ~ sdl                           = (sensitive value)
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

  # module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 6 to add, 3 to change, 0 to destroy.

Changes to Outputs:
  + proxysql_endpoint          = "provider.ny-01.node.infra.lumeweb.com:30773"
  + renterd_autopilot_endpoint = "autopilot.node.testing.pinner.xyz"
  + renterd_bus_endpoint       = "bus.node.testing.pinner.xyz"
  + renterd_workers_endpoints  = [
      + "worker.node.testing.pinner.xyz",
    ]

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (portal)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |                                               RESOURCE                                                |
|--------|-------------------------------------------------------------------------------------------------------|
| add    | `cloudns_dns_record.renterd_autopilot`                                                                |
|        | `cloudns_dns_record.renterd_bus`                                                                      |
|        | `cloudns_dns_record.renterd_workers[0]`                                                               |
|        | `module.renterd_cluster.module.renterd_autopilot.module.renterd_deployment.akash_deployment.service`  |
|        | `module.renterd_cluster.module.renterd_bus.module.renterd_deployment.akash_deployment.service`        |
|        | `module.renterd_cluster.module.renterd_workers[0].module.renterd_deployment.akash_deployment.service` |
| update | `module.proxysql.module.proxysql_deployment.akash_deployment.service`                                 |
|        | `module.mysql_cluster.module.nodes["0"].module.mysql_deployment.akash_deployment.service`             |
|        | `module.mysql_cluster.module.nodes["1"].module.mysql_deployment.akash_deployment.service`             |

| CHANGE |            OUTPUT            |
|--------|------------------------------|
| add    | `proxysql_endpoint`          |
|        | `renterd_autopilot_endpoint` |
|        | `renterd_bus_endpoint`       |
|        | `renterd_workers_endpoints`  |

</details>

</details>